examples/query_with_requested_datasources_and_international_request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:auth001="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" xmlns:fin012="urn:fin.012.001.03" xmlns:head001="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:root="urn:fi:tulli:wsdl_root.002">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <root:ApplicationRequest id="applicationRequest">
            <head001:AppHdr>
                <head001:CharSet>UTF-8</head001:CharSet>
                <head001:Fr>
                    <head001:OrgId>
                        <head001:Id>
                            <head001:OrgId>
                                <head001:Othr>
                                    <head001:Id>0245442-8</head001:Id>
                                    <head001:SchmeNm>
                                        <head001:Cd>Y</head001:Cd>
                                    </head001:SchmeNm>
                                </head001:Othr>
                            </head001:OrgId>
                        </head001:Id>
                    </head001:OrgId>
                </head001:Fr>
                <head001:To>
                    <head001:OrgId>
                        <head001:Id>
                            <head001:OrgId>
                                <head001:Othr>
                                    <head001:Id>0245442-8</head001:Id>
                                    <head001:SchmeNm>
                                        <head001:Cd>Y</head001:Cd>
                                    </head001:SchmeNm>
                                </head001:Othr>
                            </head001:OrgId>
                        </head001:Id>
                    </head001:OrgId>
                </head001:To>
                <head001:BizMsgIdr>4oc/hNIGToqguU4EdgDw5w==</head001:BizMsgIdr>
                <head001:MsgDefIdr>auth.001.001.01</head001:MsgDefIdr>
                <head001:CreDt>2023-06-15T11:16:45.905Z</head001:CreDt>
                <head001:Sgntr>
                    <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <SignedInfo>
                            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                            <Reference URI="#applicationRequest">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                                <DigestValue>mUcmHfHc7FryvRqUvcnsaFWO5Fr0u+jfhB3VoebRx/s=</DigestValue>
                            </Reference>
                        </SignedInfo>
                        <SignatureValue>gteKuSJLLkLNi9oiYzXiBQEJWE5l2vK+RcYfBt0vjk8PR96GCrXZ5q2lxnnJhU5j
                            7RrG4TBcM7rnfOZznbzpbDySzE+OQT+PrNoryCUUIT0VrJXzCxyFavYEbIjyubs/
                            55LtxLk4zk/ZZDHvaPtMXvCuvHmcj6R1JlVf4/UDJ316E/ywRCTg/DGpBpN/jBGI
                            LLGKKgdL/SEcJB+njcBd5eFGQrpP3cXwqUe1p+/c50orJerFkcfJ7ZIYSQROS1Wp
                            RAkdoGBdf4A/YvHOVbTlQw1lgtKzoBA4yq2p8saHRw08XjPuA7xF974R52iVWwkb
                            7+rfNuNLPYXrc9iLtMSjukkIXSfHyyx8pd0GQoUoQ6ubSboloM1BSe8tRtGcX8Mu
                            90pp83a3D3qwzLnNfEG9NOMGWsAqrq7r1lrI8Ka2A71soiOgEaQyYynt6+ZevemM
                            FdGzLr+/q+9jb3mqH5VpeatgHsHctkcaeOQ8iuq6mGuTEpFAOvSxP+Udat+lG5rX
                            /NQ8vbc4rM7EHGiyhrjWki8nrTuQZeuB/qooBhaYQ9H9p8gkcOdAcLuWq40B6FQi
                            Xc2xU636OD3TWOcMbDMl1L+75hr3oJzZyi+swo/HhBv+UXI730Rg6l8BlkGxpXPO
                            kfisoeh3AfO6O76IE9NmErAV5dKwiyGkJtu6WMTfNkw=</SignatureValue>
                        <KeyInfo>
                            <X509Data>
                                <X509Certificate>MIIHdTCCBV2gAwIBAgIPAYejdUC9hJyavFMlG1m5MA0GCSqGSIb3DQEBDQUAMIGH
                                    MQswCQYDVQQGEwJGSTEpMCcGA1UECgwgRGlnaS0gamEgdmFlc3RvdGlldG92aXJh
                                    c3RvIFRFU1QxHzAdBgNVBAsMFlRlc3RpcGFsdmVsdXZhcm1lbnRlZXQxLDAqBgNV
                                    BAMMI0RWViBURVNUIFNlcnZpY2UgQ2VydGlmaWNhdGVzIC0gRzJSMB4XDTIzMDQy
                                    MzIxMDAwMFoXDTI1MDQyMzIwNTk1OVowcjELMAkGA1UEBhMCRkkxEDAOBgNVBAgM
                                    B0ZpbmxhbmQxETAPBgNVBAcMCEhlbHNpbmtpMQ4wDAYDVQQKDAVUdWxsaTESMBAG
                                    A1UEBRMJMDI0NTQ0Mi04MRowGAYDVQQDDBFhcGktdGVzdC50dWxsaS5maTCCAiIw
                                    DQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAMpXcb2AVdNCBYiPjekpFNifd4HE
                                    r3leGAKbVVameHn1HGxO7fFh0vcYCU//luT1uliRObWDSq04yQQCeDcWiEHFYZNr
                                    bojfSevft/Sa36mJnB3zg+FcTpz/6NADsKF/qGJ2xy6+Neq5N4wpMG/LTV+UMjXe
                                    5Qae9LLhGDcWkSl7EBSm5xJKaiAL2NAJNWLVTnzWXDPoZhamMUjiCnWPWjxhPv4y
                                    9+72cEkkZl3zkk90Icxn5Nr4fZERM2b0CjbTMQyckP1cD0gm5adbGBI+hYthCy96
                                    H6SLRtPsMAtJ4jakw03z2ZeBrOfIrlxig/9SkIjk5lj95SdOBDqwvP04xMrfUnGk
                                    OY4Ddpj592HLQbhFKBvi7minPW/+fz2mHbIW8DN+s9fBho50v+V3A5sPdljrtMWP
                                    Mi+Mx0hyggjCrBkbL5t55AyIRTQGJwUsXFFwg0tzby50kazSg8EP2oobA2rYlXyR
                                    BT9VZNDM3CwPCNozuIQE36NIGYQiCuNR8apxJR5N0z4oxnBS9rsOivhXAAAEEDC3
                                    UpIfpISp3dn0qwfMInmUaVxuam/pf82XmJd+PTKXQyTPQ+/fsqMyfeXCa0n0/5eP
                                    h7WTBZhr+lnKH2+yQdMGXdnB3VFIQDARz8uJidIxB1VXurEhkU7D10rybggGcciM
                                    LnL3Mt1R1Uzw0A3zAgMBAAGjggHwMIIB7DAfBgNVHSMEGDAWgBQ0BfLbBt0zIGzh
                                    CAfHbE/wbKQedDAdBgNVHQ4EFgQUIqT4OWVbYGTmMHQzDvbNEZILTZYwDgYDVR0P
                                    AQH/BAQDAgbAMIHXBgNVHSAEgc8wgcwwCAYGBACPegEHMIG/BgoqgXaEBWMKgjEC
                                    MIGwMCcGCCsGAQUFBwIBFhtodHRwOi8vd3d3LmZpbmVpZC5maS9jcHM5OS8wgYQG
                                    CCsGAQUFBwICMHgadlZhcm1lbm5lcG9saXRpaWtrYSBvbiBzYWF0YXZpbGxhIC0g
                                    Q2VydGlmaWthdHBvbGljeSBmaW5ucyAtIENlcnRpZmljYXRlIHBvbGljeSBpcyBh
                                    dmFpbGFibGUgaHR0cDovL3d3dy5maW5laWQuZmkvY3BzOTkwDwYDVR0TAQH/BAUw
                                    AwEBADA5BgNVHR8EMjAwMC6gLKAqhihodHRwOi8vcHJveHkuZmluZWlkLmZpL2Ny
                                    bC9kdnZ0c3AycmMuY3JsMHQGCCsGAQUFBwEBBGgwZjAzBggrBgEFBQcwAoYnaHR0
                                    cDovL3Byb3h5LmZpbmVpZC5maS9jYS9kdnZ0c3AycmMuY3J0MC8GCCsGAQUFBzAB
                                    hiNodHRwOi8vb2NzcHRlc3QuZmluZWlkLmZpL2R2dnRzcDJyYzANBgkqhkiG9w0B
                                    AQ0FAAOCAgEAYC2U3+YRPdM4puokOLPKF/k/cpYf2DHg1GG2jrBHNKfTOSMW0c+X
                                    LIwgXDOK+xMP3r/YrPAaUpxAMAkMQrqhrXxHkV7JJnjDirN/FaCfsTvT1AapM9Q3
                                    b3QzdO+eMGqm2P01X7QcetDBXcaZMZQi5G3SXZjUveyCvKZnhwRUreANZYQzIDaO
                                    +sKcebIIdNPUfLDorHBuDi4m6KLOW79uJM/nPs3sM4eJhBkptJakuSW5ikUyT5aM
                                    E3GkxQO7pq3NnEsj/l4uykoR5iD0dQjY4ILbDKvAvyZNi32F+F+npX36Kr3kfMLy
                                    5rbJB9tCDd+RpCCViVnjLM/ynTY8wonL9FrSGsMOJG2MqHo3KnGJQdg53Q+j4ucV
                                    Icu2azVCjCZUYijCbSW4+38A8i4Uhv1nCvzh0pHq5y1M3gS5lmkP8Ot3saDuUIFm
                                    2DPcEjryY7Iy28ZJKqp2Kad8hApusigDYcNDyZe2qFbxOGzJewjX1I+Whuu4/Ogj
                                    ++kRARRhnVqJj8MADaU0wv1gRO3Btedh23NrBEoodIyFds7zc9jNb3tZIGbJ1Uij
                                    3JUcQC4PPIPVGHSpaXygAmz2NWsLoJQKGqGibNrlsEmjgKjP58sLDhC33vlPhCxJ
                                    DaPxxQ3RY1rJnOpt0bwO/JzOA3iRZQFBLA117rdRugsVY7WxxBKX9B0=</X509Certificate>
                            </X509Data>
                        </KeyInfo>
                    </Signature>
                </head001:Sgntr>
            </head001:AppHdr>
            <auth001:Document>
                <auth001:InfReqOpng>
                    <auth001:InvstgtnId>Tutkinta 15062023</auth001:InvstgtnId>
                    <auth001:LglMndtBsis>
                        <auth001:Prgrph>TestLegalMandate</auth001:Prgrph>
                    </auth001:LglMndtBsis>
                    <auth001:CnfdtltySts>true</auth001:CnfdtltySts>
                    <auth001:InvstgtnPrd>
                        <auth001:Dt>
                            <auth001:FrDt>2020-09-01</auth001:FrDt>
                            <auth001:ToDt>2023-06-15</auth001:ToDt>
                        </auth001:Dt>
                    </auth001:InvstgtnPrd>
                    <auth001:SchCrit>
                        <auth001:CstmrId>
                            <auth001:Pty>
                                <auth001:Nm>Yritys ABCD</auth001:Nm>
                                <auth001:Id>
                                    <auth001:OrgId>
                                        <auth001:Othr>
                                            <auth001:Id>1</auth001:Id>
                                            <auth001:SchmeNm>
                                                <auth001:Cd>NAME</auth001:Cd>
                                            </auth001:SchmeNm>
                                        </auth001:Othr>
                                    </auth001:OrgId>
                                </auth001:Id>
                            </auth001:Pty>
                            <auth001:AuthrtyReq>
                                <auth001:Tp>
                                    <auth001:MsgNmId>supl.027.001.01</auth001:MsgNmId>
                                </auth001:Tp>
                                <auth001:InvstgtdRoles>
                                    <auth001:Cd>ALLP</auth001:Cd>
                                </auth001:InvstgtdRoles>
                            </auth001:AuthrtyReq>
                            <auth001:AuthrtyReq>
                                <auth001:Tp>
                                    <auth001:MsgNmId>fin.002.001.03</auth001:MsgNmId>
                                </auth001:Tp>
                                <auth001:InvstgtdRoles>
                                    <auth001:Cd>ALLP</auth001:Cd>
                                </auth001:InvstgtdRoles>
                            </auth001:AuthrtyReq>
                            <auth001:AuthrtyReq>
                                <auth001:Tp>
                                    <auth001:MsgNmId>fin.013.001.04</auth001:MsgNmId>
                                </auth001:Tp>
                                <auth001:InvstgtdRoles>
                                    <auth001:Cd>ALLP</auth001:Cd>
                                </auth001:InvstgtdRoles>
                            </auth001:AuthrtyReq>
                        </auth001:CstmrId>
                    </auth001:SchCrit>
                    <auth001:SplmtryData>
                        <auth001:Envlp>
                            <fin012:Document>
                                <fin012:InfReqFin012>
                                    <fin012:AuthorityInquiry>
                                        <fin012:OfficialId>Viranomaisen nimi</fin012:OfficialId>
                                        <fin012:OfficialSuperiorId>Esimiehen nimi</fin012:OfficialSuperiorId>
                                    </fin012:AuthorityInquiry>
                                    <fin012:RequestedDataSources>
                                        <fin012:DataSourceOrgId>1111111-2</fin012:DataSourceOrgId>
                                        <fin012:DataSourceOrgId>1111111-1</fin012:DataSourceOrgId>
                                    </fin012:RequestedDataSources>
                                    <fin012:InternationalRequest>true</fin012:InternationalRequest>
                                </fin012:InfReqFin012>
                            </fin012:Document>
                        </auth001:Envlp>
                    </auth001:SplmtryData>
                </auth001:InfReqOpng>
            </auth001:Document>
        </root:ApplicationRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>